[
    {
        "name": "Emilia Capitals",
        "url": "",

        "full_description": {
            "full_description": "",

            "philosophy": "
            
Our investment philosophy
At Emilia Capital, we believe investments should do more than generate profit—they should make a meaningful impact. We’re passionate about backing startups that aim to change the world for the better while running sustainable, profitable businesses.

Growth with purpose
We know from experience that a thriving business can also be a force for good. At Yoast, we built a profitable company that transformed the web and uplifted our community. This taught us that growth doesn’t have to come at the expense of people or purpose. Companies can scale while supporting their local communities, paying fair wages, and creating lasting value.

Investing where we add value
We only invest when we can genuinely contribute to a company’s success. As experts in online marketing, SEO, and WordPress, we tend to focus on tech companies where our skills make a difference. Our goal is to help startups grow faster and smarter by sharing our knowledge and experience.

Our core investment values
We look for companies that align with at least one of our three guiding principles:

1. Open source enthusiasts
We’re deeply committed to open source software and the WordPress ecosystem. Our investments in companies like Atarim, Equalize Digital, Patchstack, Extendify, and PersonalizeWP reflect this passion. This also means that we ask our investment in the WordPress world to respect the GPL, follow WordPress guidelines, and actively engage with the WordPress community.

Read more about our commitment to open source.

2. Sustainability champions
Making the world greener is very important to us. That’s why we invest in sustainable solutions like Peerby, a platform for sharing tools and resources. We’re also proud to back Deeploy, which makes AI more transparent and ethical.

Read more about our sustainability champions and why we want to invest in a better future.

3. Advocates for female entrepreneurs
We know how tough it can be for women to succeed in tech. That’s why we prioritize investments in female-founded companies like Equalize Digital, Stieglitz, Nina Care, and recently Witlof. Empowering women in business isn’t just good ethics—it’s smart investing.

Read more about why we are advocates for female entrepreneurs.

Our Hybrid Investment Model
For early-stage companies—especially in the WordPress ecosystem—we often use a hybrid investment approach. This means we combine financial investment with hands-on work, providing expertise from our team to help startups tackle challenges quickly. During the investment process, we agree on how much will be invested as cash and how much will go toward dedicated support from Emilia. This model ensures we’re actively involved in driving progress.

Collaborating with Investment Partners
When we don’t take a hands-on role, we partner with other investors to share expertise and resources. Collaboration increases the chances of success and brings diverse perspectives to the table, benefiting our portfolio companies.

At Emilia Capital, we’re not just investors—we’re partners in building a brighter future. If you’re a startup founder passionate about creating meaningful change, we’d love to hear from you. Let’s grow something great together.

Looking for investment?
Send us your deck, if we like it, we’ll be in touch for a call!

Get in touch

Home

About Us

Investments

Projects

Contact

©️️ Emilia Capital

            "
        }
    }
]